{
  "privacyPolicy": {
    "introduction": {
      "title": "Privacy Policy",
      "description": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You. We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy."
    },
    "interpretationAndDefinitions": {
      "interpretation": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or plural.",
      "definitions": {
        "account": "A unique account created for You to access our Service or parts of our Service.",
        "affiliate": "An entity that controls, is controlled by or is under common control with a party, where 'control' means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.",
        "company": "Sapna Sangeeta (referred to as either 'the Company', 'We', 'Us' or 'Our' in this Agreement).",
        "cookies": "Small files placed on Your computer, mobile device, or any other device by a website, containing the details of Your browsing history on that website among its many uses.",
        "country": "Madhya Pradesh, India",
        "device": "Any device that can access the Service such as a computer, cellphone, or digital tablet.",
        "personalData": "Any information that relates to an identified or identifiable individual.",
        "service": "The Website.",
        "serviceProvider": "Any natural or legal person who processes the data on behalf of the Company.",
        "usageData": "Data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (e.g., the duration of a page visit).",
        "website": "Sapna Sangeeta, accessible from https://sapnasangeeta.com/",
        "you": "The individual accessing or using the Service, or the company or other legal entity on behalf of which such individual is accessing or using the Service, as applicable."
      }
    },
    "collectingAndUsingPersonalData": {
      "typesOfDataCollected": {
        "personalData": "We may ask You to provide certain personally identifiable information such as name, email address, and usage data.",
        "usageData": {
          "description": "Usage Data is collected automatically when using the Service.",
          "details": [
            "Device’s Internet Protocol (IP) address, browser type, browser version.",
            "Pages of the Service visited, time and date of visit, time spent on pages.",
            "Mobile device type, unique device ID, mobile operating system, mobile Internet browser."
          ]
        }
      },
      "trackingTechnologiesAndCookies": {
        "description": "We use Cookies and similar tracking technologies to track activity and store certain information.",
        "types": {
          "cookies": "Small files placed on Your Device.",
          "webBeacons": "Small electronic files for tracking statistics, popularity, and server integrity."
        },
        "categories": [
          {
            "type": "Necessary / Essential Cookies",
            "administeredBy": "Us",
            "purpose": "To provide services and enable functionality."
          },
          {
            "type": "Cookies Policy / Notice Acceptance Cookies",
            "administeredBy": "Us",
            "purpose": "To identify if users accepted cookie use."
          },
          {
            "type": "Functionality Cookies",
            "administeredBy": "Us",
            "purpose": "To remember preferences for a personalized experience."
          }
        ]
      }
    },
    "useOfPersonalData": {
      "purposes": [
        "To provide and maintain our Service.",
        "To manage Your Account.",
        "To contact You.",
        "To provide You with news, special offers, and general information.",
        "To manage Your requests.",
        "For business transfers.",
        "For other purposes such as analysis and improving services."
      ],
      "sharing": [
        "With Service Providers.",
        "For business transfers.",
        "With affiliates.",
        "With business partners.",
        "With other users.",
        "With Your consent."
      ]
    },
    "dataRetention": {
      "personalData": "Retained only as long as necessary for purposes set out in this policy.",
      "usageData": "Retained for a shorter period, except for security or legal obligations."
    },
    "dataTransfer": {
      "description": "Data may be transferred and processed outside Your jurisdiction.",
      "controls": "Steps are taken to ensure data security and compliance with Privacy Policy."
    },
    "deletingPersonalData": {
      "description": "You have the right to delete or request deletion of Personal Data collected about You.",
      "methods": [
        "By signing in to Your Account.",
        "By contacting Us for access, correction, or deletion."
      ]
    },
    "dataDisclosure": {
      "scenarios": [
        "Business Transactions: In case of merger, acquisition, or asset sale.",
        "Law Enforcement: If required by law or public authority.",
        "Other Legal Requirements: To protect rights, investigate wrongdoing, or comply with obligations."
      ]
    },
    "security": {
      "description": "We strive to use commercially acceptable means to protect Your Personal Data but cannot guarantee its absolute security."
    },
    "childrenPrivacy": {
      "description": "We do not knowingly collect data from children under 13. Parents can contact us for data removal."
    },
    "externalLinks": {
      "description": "Our Service may contain links to third-party websites. We are not responsible for their privacy policies or practices."
    },
    "policyUpdates": {
      "description": "We may update this Privacy Policy from time to time. Changes will be effective when posted."
    },
    "contactUs": {
      "email": "example@example.com"
    }
  }
}
